ruby/trike_trial/app/controllers/countries_controller.rb

SELECT  "countries".* FROM "countries" WHERE "countries"."code" = $1 LIMIT $2  [["code", "AU"], ["LIMIT", 1]]
---
  def shipping_rates
    @country = Country.find_by_code(shipping_rates_params[:country_code])

SELECT  "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 91], ["LIMIT", 1]]
---
  def country_first
    # TODO: check permit usage
    render json: Country.find(params["id"].to_i)

SELECT  "countries".* FROM "countries" WHERE "countries"."code" = $1 LIMIT $2  [["code", "AU"], ["LIMIT", 1]]
---
  def show_by_code
    render json: Country.find_by_code(country_code_params[:country_code])

SELECT  "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 241], ["LIMIT", 1]]
UPDATE "countries" SET "regular_shipping_rate" = $1, "express_shipping_rate" = $2, "updated_at" = $3 WHERE "countries"."id" = $4  [["regular_shipping_rate", "0"], ["express_shipping_rate", "0"], ["updated_at", 2016-10-23 05:58:21 UTC], ["id", 246]]
---
  def update
    # render json: Country.find(country_id_params["id"])
    # binding.pry
    @updated_country = Country.find(country_id_params[:id])
    @updated_country.regular_shipping_rate = country_id_params[:regular_shipping_rate].to_i
    @updated_country.express_shipping_rate = country_id_params[:express_shipping_rate].to_i
    render json: @updated_country.save

INSERT INTO "countries" ("name", "code", "regular_shipping_rate", "express_shipping_rate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @new_country = Country.insert(country_create_params)